app/views/registries/show.html.erb

SELECT "items".* FROM "items" WHERE ("items".registry_id = 1)
---
  <table>
    <% @registry.items.each do |i| %>