app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 1) LIMIT 1

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 1) LIMIT 1

  def create
    @event = Event.new(params[:event])
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "description", "end_time", "location", "name", "start_time", "updated_at") VALUES ('2010-10-01 19:02:40.493007', 'The wedding is at some church on some street. Blah Blah Blah', '2010-11-05 18:00:00.000000', 'Some church', 'Wedding Ceremony', '2010-11-05 17:00:00.000000', '2010-10-01 19:02:40.493007') RETURNING "id"