app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE ("items"."id" = 1) LIMIT 1
---
  def buy
    @registry = Registry.find(params[:registry_id])
    @item = @registry.items.find(params[:id])

SELECT "registries".* FROM "registries" WHERE ("registries"."id" = 1) LIMIT 1
---
  def new
    @registry = Registry.find(params[:registry_id])

SELECT "registries".* FROM "registries" WHERE ("registries"."id" = 1) LIMIT 1
INSERT INTO "items" ("created_at", "name", "picture", "price", "qtybought", "quantity", "registry_id", "sku", "store_id", "updated_at", "website") VALUES ('2010-09-30 13:29:17.572026', 'Pan', 'http://cdn.gadgetvenue.com/wp-content/uploads/2008/11/digital-thermoter-pan.jpg', 34.99, 0, 2, 1, 'F3J52J1L6J', 1, '2010-09-30 13:29:17.572026', 'http://www.canadiantire.ca/pan') RETURNING "id"
---
  def create
    @registry = Registry.find(params[:registry_id])
    @item = @registry.items.build(params[:item])
    if @item.save

SELECT "registries".* FROM "registries" WHERE ("registries"."id" = 1) LIMIT 1
SELECT "items".* FROM "items" WHERE ("items"."id" = 1) LIMIT 1
---
  def edit
    @registry = Registry.find(params[:registry_id])
    @item = @registry.items.find(params[:id])