app/controllers/registries_controller.rb

  def index
    @registries = Registry.all
---
SELECT "registries".* FROM "registries"

  def show
    @registry = Registry.find(params[:id])
---
SELECT "registries".* FROM "registries" WHERE ("registries"."id" = 1) LIMIT 1

  def edit
    @registry = Registry.find(params[:id])
---
SELECT "registries".* FROM "registries" WHERE ("registries"."id" = 1) LIMIT 1

  def create
    @registry = Registry.new(params[:registry])

    respond_to do |format|
      if @registry.save
---
INSERT INTO "registries" ("created_at", "name", "updated_at", "user_id") VALUES ('2010-09-30 13:27:49.236464', 'Wedding Registry', '2010-09-30 13:27:49.236464', NULL) RETURNING "id"