app/controllers/stores_controller.rb

def create
    @store = Store.new(params[:store])

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("address_id", "created_at", "name", "updated_at", "website") VALUES (NULL, '2010-09-30 13:28:28.266147', 'Canadian Tire', '2010-09-30 13:28:28.266147', 'http://www.canadiantire.ca') RETURNING "id"