app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("address_id", "created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "first_name", "last_login_at", "last_login_ip", "last_name", "last_request_at", "login", "login_count", "password_salt", "perishable_token", "persistence_token", "single_access_token", "updated_at") VALUES (NULL, '2010-10-15 16:18:57.584798', '310adb2d26fbdb09e32a85fe8fe8cf9e85d96538387b652f70a59e67e9302eb688b8c00c009d43bfb541c76cdd57978c7bd4e863590fed896622873e2f97a5d4', '2010-10-15 16:18:57.584352', '142.51.8.234', 'kevinbeswick00@gmail.com', 0, 'Kevin', NULL, NULL, 'Beswick', '2010-10-15 16:18:57.584544', 'kbeswick', 1, 'lO48ABfTZcq1Sn62VOXQ', '6Qwhcn3chxvdjPvPYD', 'c95933e15ee64d172b9d56a21877fc168453d672c8c8fac9b1db00123e0b70f748ec1c62477c4dea2e6da344630fd6802192aa260d32d3eb813fbbebd50bcb2b', 'JHElCzeR6V0NcaCPKs', '2010-10-15 16:18:57.584798') RETURNING "id"